# LevelId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementLevelFilter..::..LevelId Property
ElementLevelFilter Class See Also
---
The id of the level that will be matched to elements' associated level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId LevelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LevelId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ LevelId {
	ElementId^ get ();
}
```

# See Also
ElementLevelFilter Class
Autodesk.Revit.DB Namespace